{"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"output_dim": 12, "batch_input_shape": [null, 8], "init": "uniform", "trainable": true, "input_dtype": "float32", "W_constraint": null, "b_regularizer": null, "b_constraint": null, "name": "dense_3", "bias": true, "activity_regularizer": null, "activation": "relu", "W_regularizer": null, "input_dim": 8}}, {"class_name": "Dense", "config": {"name": "dense_4", "init": "uniform", "trainable": true, "W_constraint": null, "b_regularizer": null, "b_constraint": null, "output_dim": 8, "bias": true, "activity_regularizer": null, "activation": "relu", "W_regularizer": null, "input_dim": null}}, {"class_name": "Dense", "config": {"name": "dense_5", "init": "uniform", "trainable": true, "W_constraint": null, "b_regularizer": null, "b_constraint": null, "output_dim": 1, "bias": true, "activity_regularizer": null, "activation": "sigmoid", "W_regularizer": null, "input_dim": null}}], "keras_version": "1.0.7"}